_org_posts/_posts/2022-01-09-abc234-d.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: abc234 D - Prefix K-th Max
#+HTML: tags: AtCoder 수학
#+HTML: ---
#+OPTIONS: ^:nil

** D - Prefix K-th Max

** 접근하기
- permutation에서 K개를 나열하고, K번째를 출력 -> 이때는 min이 됨

#+BEGIN_EXAMPLE
11 5
3 7 2 5 11 / 6 1 9 8 10 4    - 2 가 최소
3 7 2 5 11 6 / 1 9 8 10 4    - 6이 들어오면, 3이 최소, 2가 밀려남
3 7 2 5 11 6 1 / 9 8 10 4    - 1이 들어오면, 3이 최소 
3 7 2 5 11 6 1 9 / 8 10 4
3 7 2 5 11 6 1 9 8 / 10 4
3 7 2 5 11 6 1 9 8 10 / 4

k번째 수 < 큰값 -> k번째수가 바뀜

k번째수 > 작은값 -> 안 바뀜
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;

int N, K;
int a[500050];

priority_queue < int, vector<int>, greater<int> > pq;

int main(int argc, char* argv[])
{
    scanf("%d %d", &N, &K);

    int num;
    for(int i=0;i<K;i++) {
        scanf("%d", &num);
        pq.push(num);
    }
    int first = pq.top();
    printf("%d\n", first);
    for(int i=0;i<N-K;i++) {
        scanf("%d", &num);
        int cur = pq.top();
        
        if (cur < num) {
            pq.pop();
            pq.push(num);
        }
        int tmp = pq.top();
        printf("%d\n", tmp);
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://atcoder.jp/contests/abc234/tasks/abc234_d
