_posts/2022-01-09-abc234-d.html
---
title: abc234 D - Prefix K-th Max
tags: AtCoder 수학
toc: true
toc_sticky: true
---

<div id="outline-container-orgd2ec463" class="outline-2">
<h2 id="orgd2ec463">D - Prefix K-th Max</h2>
</div>

<div id="outline-container-org37691b4" class="outline-2">
<h2 id="org37691b4">접근하기</h2>
<div class="outline-text-2" id="text-org37691b4">
<ul class="org-ul">
<li>permutation에서 K개를 나열하고, K번째를 출력 -&gt; 이때는 min이 됨</li>
</ul>

<pre class="example">
11 5
3 7 2 5 11 / 6 1 9 8 10 4    - 2 가 최소
3 7 2 5 11 6 / 1 9 8 10 4    - 6이 들어오면, 3이 최소, 2가 밀려남
3 7 2 5 11 6 1 / 9 8 10 4    - 1이 들어오면, 3이 최소 
3 7 2 5 11 6 1 9 / 8 10 4
3 7 2 5 11 6 1 9 8 / 10 4
3 7 2 5 11 6 1 9 8 10 / 4

k번째 수 &lt; 큰값 -&gt; k번째수가 바뀜

k번째수 &gt; 작은값 -&gt; 안 바뀜
</pre>
</div>
</div>

<div id="outline-container-org3c57d75" class="outline-2">
<h2 id="org3c57d75">코드</h2>
<div class="outline-text-2" id="text-org3c57d75">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[500050];

<span style="color: #8ae234; font-weight: bold;">priority_queue</span> &lt; <span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt;, <span style="color: #8ae234; font-weight: bold;">greater</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; &gt; <span style="color: #ff6347;">pq</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;K);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;K;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num);
        pq.push(num);
    }
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">first</span> = pq.top();
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, first);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-K;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num);
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cur</span> = pq.top();

        <span style="color: #729fcf; font-weight: bold;">if</span> (cur &lt; num) {
            pq.pop();
            pq.push(num);
        }
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tmp</span> = pq.top();
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, tmp);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org81d2056" class="outline-2">
<h2 id="org81d2056">문제 링크</h2>
<div class="outline-text-2" id="text-org81d2056">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc234/tasks/abc234_d">https://atcoder.jp/contests/abc234/tasks/abc234_d</a></li>
</ul>
</div>
</div>
